Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པ་དྲི་མེད་ཚོང་དཔོན་གྱི། །བུ་ཚེ་དེ་བཞིན་གཤེགས་པ་གྲགས་བླ་ལ། །མེ་ཏོག་བར་ཤིག་སྐྱེ་བའི་ས་གཞི་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Vimala, when the son of a merchant, Offered a field of vārṣikī flowers To the thus-gone Highest Fame And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དོན་ཀུན་གཟིགས་པ་དེད་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷ་ཡི་རྒྱལ་པོ་ལ། །མུ་ཏིག་དག་གི་ཕྲེང་བ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sarvārtha­darśin, when a captain, Offered a pearl garland To the thus-gone King of Gods And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དཔའ་བོ་སྤོས་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་དམར་སེར་འོད་དེ་ལ། །ཙན་དན་དག་གི་གདན་ཁྲི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Śūra, when an incense merchant, Offered a sandalwood throne To the thus-gone Orange Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འབྱོར་ལྡན་ཚོང་འདུས་པ་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བདེ་བར་འདུད་དེ་ལ། །སྙུན་རྐྱེན་གསོས་སྨན་མར་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Samṛddha, when a market merchant, Offered medicinal butter To the thus-gone Delightful Veneration And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བསོད་ནམས་བ་ལང་རྫི་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་སེམས་དེ་ལ། །སྣོད་དག་ཞོ་ཡིས་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Puṇya, when a cowherd, Offered vessels filled with yogurt To the thus-gone Intelligent Mind And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྒྲོན་མ་ཚལ་གྱི་ལས་བྱེད་ཚེ། །དེ་བཞིན་གཤེགས་པ་དབྱིག་གསལ་དེ་ལ་ནི། །ཨ་མྲའི་འབྲས་བུ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Pradīpa, when a garden worker, Offered mango fruits To the thus-gone Luminous Treasure And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་འོད་འཕྲོ་ནི། །རོ་བྲོ་འཚོང་ཚེ་དེ་བཞིན་གཤེགས་པ་པོ། །སྐྱོན་ཞི་དེ་ལ་ཁ་རའི་དུམ་བུ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Guṇārci, when a juice vendor, Offered a piece of sugar To the thus-gone Pacification of Flaws And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་བློ་ཡངས་ཀུན་རྒྱུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་རྒྱུ་སྐར་རྒྱལ་པོ་ལ། །ལོ་མ་དག་གི་རི་ལུ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Vipulabuddhi, when a wandering ascetic, Offered a leaf ball To the thus-gone Star King And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལེགས་སྐྱེས་རྒྱ་མཚོའི་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བསྙེངས་དང་བྲལ་དེ་ལ། །ན་བཟའ་སྟོང་ཕྲག་བརྒྱ་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sujāta, when a seafaring merchant, Offered one hundred thousand garments To the thus-gone Fearless And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ནོར་ལྷ་ཤིང་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་བློ་གསལ་དེ་ལ་ནི། །རྩྭ་བམ་སྒྲོན་མེ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Vasudeva, when a wood merchant, Offered dry grass torches To the thus-gone Clear Mind And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡིད་གཉིས་སྤོང་བ་གསེར་མགར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡིད་གཉིས་སེལ་མཛད་ལ། །གསེར་གྱི་མེ་ཏོག་དག་ནི་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vimatijaha, when a goldsmith, Scattered flowers of gold To the thus-gone Dispeller of Doubt And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འཛིན་པ་དཔག་མེད་གསེར་རྟོག་ཚེ། །དེ་བཞིན་གཤེགས་པ་བྱམས་པའི་དཔལ་དེ་ལ། །གསེར་ནི་སྤར་གང་གཏོར་ཏེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Amitadhara, when a gold dealer, Scattered handfuls of gold Before the thus-gone Glory of Love And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་མཆོག་སྲིད་སྡེ་དཔོན་གྱི། །བུ་ཚེ་དེ་བཞིན་གཤེགས་པ་གཙོ་མཆོག་ལ། །གསེར་ལས་བྱས་པའི་གདུགས་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Vararuci, when the son of a captain, Offered parasols made of gold To the thus-gone Supreme Leader And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཆོམས་མེད་ལྕགས་མགར་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྣ་ཚོགས་གསུང་དེ་ལ། །ཨ་ཧ་ཏ་ཀ་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Anihata, when a blacksmith, Offered ahataka To the thus-gone Diverse Teaching And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མི་གནས་གྲོང་ཁྱེར་རྟེན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་གཟིགས་དེ་ལ། །མེ་ཏོག་རངས་པ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Asthita, when a city beggar, Offered ravishing flowers To the thus-gone Universal Vision And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དེར་གནས་ཐགས་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བ་གཟིགས་དེ་ལ། །སྐུ་རེགས་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Tacchaya, when a weaver, Offered belts To the thus-gone Moon Vision And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཚོགས་ཆེན་གཙོ་བོ་མགོན་མེད་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་བདུད་ཟིལ་གནོན་པ་དེ་ལ་ནི། །མོན་སྲན་གྲེའུ་ཡི་འབྲུ་མར་མར་མེ་ཕུལ་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Gaṇimukha, when the son of a destitute, Offered a lamp with māṣa bean oil To the thus-gone Conqueror of the Māras And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འགྲོ་བའི་འོད་ཟེར་འཁོར་ལོས་སྒྱུར་བའི་ཚེ། །བདེ་གཤེགས་ཤིང་རྟ་ཆེན་པོ་འཁོར་བཅས་བྱེ་སྟོང་ལ། །རྒྱལ་པོའི་ཞལ་ཟས་དག་ནི་བྲིམ་པ་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jagadraśmi, when a universal monarch, Offered royal food To the well-gone Great Chariot and his ten billionfold retinue, And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཕལ་ཆེན་འཁོར་ལོས་སྒྱུར་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སེང་གེའི་སྟོབས་ཀྱིས་གཤེགས་དེ་ལ། །དཔག་ཚད་བཅུ་གཉིས་ཁྱོན་ཙམ་སྐྱེད་མོས་ཚལ་ཕུལ་ནས། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Prabhūta, when a universal monarch, Offered a twelve-league-large park To the thus-gone Gone with Lion Strength And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྒྱལ་ནི་འབྲུ་མར་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་ཚིམ་དེ་ལ། །ཞབས་བསྐུ་བ་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Puṣya, when an oil producer, Offered foot massage To the thus-gone Satisfying Radiance And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་མཐའ་ཡས་ཁྲུས་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་སྦེད་པ་དེ་ལ་ནི། །འདག་པའི་ཆལ་གྱིས་སྣོད་དག་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Anantatejas, when a bath attendant, Offered vessels filled with soap To the thus-gone Thoroughly Hidden And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དོན་གྱི་བློ་གྲོས་ནད་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དོན་གྲུབ་མཐུ་རྩལ་ལ། །ཁ་རའི་དུམ་བུ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Arthamati, when ill, Offered pieces of sugar To the thus-gone Powerful Accomplishment And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྨན་པའི་རྒྱལ་པོ་ཕྱེ་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཉི་མའི་འོད་དེ་ལ། །ཕྱེ་ཡི་བསོད་སྙོམས་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vaidyarāja, when a flour merchant, Offered alms of flour To the thus-gone Sunlight And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཐ་བ་སྤངས་པ་སྨན་པའི་ཚེ། །དགེ་འདུན་དག་ལ་མར་ཁུ་ཕུལ་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་གཟིགས་པའི་ཕུང་པོ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Prahāṇakhila, when a physician, Offered melted butter to the members of the saṅgha Before the thus-gone Vision Aggregate And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིམས་མེད་ཤིང་བཟོ་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་རྣམ་དག་བློ་དེ་ལ། །ཤིང་རྟ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Nirjvara, when a carpenter, Offered chariots To the thus-gone Pure Mind And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ལེགས་བྱིན་བྲམ་ཟེའི་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཚོགས་ཅན་མྱ་ངན་འདས་པ་ན། །མར་མེའི་ཕྲེང་བ་དངར་བ་སྟོང་སྙེད་ཕུལ་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Sudatta, when the son of a brahmin, Offered garlands of thousands of bright lamps When the thus-gone Possessor of the Gathering was attaining nirvāṇa, And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་གྲགས་བྱིན་གྲོང་ཁྱེར་མཆོད་རྟེན་ལ། །རྟེན་པའི་ཚེ་ན་དེ་བཞིན་གཤེགས་པ་ནོར་བུ་གསལ། །གྲོང་ཁྱེར་དག་ཏུ་གཤེགས་ཀར་མེ་ཏོག་གཏོར་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Yaśadatta, when a beggar by a stūpa in the city, Scattered flowers When the thus-gone Luminous Jewel was about to enter the city, And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་བྱིན་པ་ནི། །ནོར་བུ་མཁན་ཚེ་དེ་བཞིན་གཤེགས་པ་པོ། །ཡོན་ཏན་འོད་ལ་ནོར་བུའི་བླ་རེ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Kusumadatta, when a jeweler, Offered a jeweled canopy To the thus-gone Luminous Qualities And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྐྱེས་བུས་བྱིན་པ་ཐགས་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཉི་མའི་སྒྲོན་དེ་ལ། །རས་ཀྱི་ཁ་ཚར་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Puruṣadatta, when a weaver, Offered woven tassels To the thus-gone Sun Lamp And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེའི་སྡེ་ནི་ཕྲེང་རྒྱུད་ཀྱི། །བུ་མོར་གྱུར་ཚེ་བདེ་གཤེགས་འབྱོར་ལྡན་འོད་ཟེར་ལ། །མེ་ཏོག་མྱ་ངན་འཚང་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Vajrasena, when the daughter of a garland maker, Offered aśoka flowers To the well-gone Radiant Wealth And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཕལ་ཆེན་བྱིན་ནི་གར་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྟོན་པར་དགྱེས་དེ་ལ། །ཚིགས་སུ་བཅད་པ་གཅིག་གིས་བསྟོད་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mahādatta, when a dancer, Offered a stanza of praise To the thus-gone Delighting in Teaching And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཞི་བའི་བློ་གྲོས་རྒྱལ་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལེགས་པར་དོན་སེམས་ལ། །བར་ཤི་མེ་ཏོག་དྲི་ལྡན་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Śāntimati, when a king, Scattered fragrant vārṣikī flowers Before the thus-gone Well-Considered Aims And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྤོས་གླང་གདུགས་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་གཟིགས་དེ་ལ། །གྲོ་བ་དག་ལས་བྱས་པའི་གདུགས་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Gandhahastin, when a parasol maker, Offered a birchbark parasol To the thus-gone Universal Vision And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྲེད་མེད་བུ་ནི་ཁྱིམ་བདག་ཚེ། །འབྲོག་དགོན་དག་ཏུ་དགེ་སློང་དགེ་འདུན་བཏུང་ཆུ་ཕུལ། །དེ་བཞིན་གཤེགས་པ་སེང་གེའི་རྒྱལ་མཚན་དེ་ལ་ནི། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Nārāyaṇa, when a householder, Offered drinking water to the saṅgha of monks in a remote wilderness Before the thus-gone Lion Banner And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དེས་པ་དམན་ལས་བྱེད་བུའི་ཚེ། །བསླབ་པའི་གཞི་ལྔ་དག་ལས་གཟུང་བ་བྱས་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་མཉམ་པར་གནས་པ་དེ་ལ་ནི། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Sūrata, when the son of menial worker, Observed the five bases for training Before the thus-gone Abiding EvenlyAnd in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མི་ཚུགས་ནད་པ་མགོན་མེད་བོར་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཐུ་རྩལ་ཆེན་པོ་དེ་ཡི་ལམ། །ལག་མཐིལ་ཙམ་ཞིག་ཕྱག་དར་ལེགས་པར་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Anihata, when an abandoned and helpless sick person, Carefully swept a path with only the of the palm of his hand For the thus-gone Great Power, And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཉི་ཟླ་གཽ་ཏམ་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཁས་མཆོག་པད་སྤྱན་ལ། །དབྱར་གནས་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Candrārka, when Gautama, Made offerings to the participants of the rains retreat Before the thus-gone Lotus Eyes of Supreme Learning And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་གློག་ཏོག་རྒྱ་མཚོའི་ཚོང་པའི་ཚེ། །ཁྲུ་བརྒྱད་ཀྱིས་བསྐོར་སྤུག་ལས་བྱས་པའི་གདུགས་ཕུལ་ནས། །དེ་བཞིན་གཤེགས་པ་ཉི་མའི་འོད་ཟེར་དེ་ལ་ནི། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Vidyutketu, when a seafaring merchant, Offered a parasol made of musāragalva, eight cubits in circumference, To the thus-gone Radiance of the Sun And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་མཆོད་པ་ལས་བྱེད་ཚེ། །དེ་བཞིན་གཤེགས་པ་གསལ་བ་མཐའ་ཡས་ལ། །ལས་བཏང་བྱས་པས་རྙེད་པ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Mahita, when a worker, Offered his wages To the thus-gone Infinite Clarity And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དཔལ་སྦས་ཤིང་སྲུངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཐའ་ཡས་གཟུགས་དེ་ལ། །ཨ་མྲ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Śrīgupta, when the guard of a field, Offered mangoes To the thus-gone Infinite Form And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡེ་ཤེས་ཉི་མ་རྫ་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷ་ཡི་གདུགས་དེ་ལ། །ལྷུང་བཟེད་དང་ནི་གུན་དྷེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jñānasūrya, when a potter, Offered an alms bowl and a water pot To the thus-gone Divine Parasol And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དོན་གྲུབ་སྨན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འོད་ཟེར་ལ། །སྤོས་ཀྱི་རེང་བུ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Siddhārtha, when a physician, Offered incense sticks To the thus-gone Jewel Radiance And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ལྷུན་བརྩེགས་ཁྲལ་མིའི་ཚེ། །བདེ་གཤེགས་ཡུལ་འཁོར་ཁ་ལོ་སྒྱུར་དེ་ལ། །ལྷགས་པའི་དུས་སུ་ཤིང་ཁུར་གཅིག་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Merukūṭa, when a tenant farmer, Offered a load of wood during a cold spell To the well-gone Leader of the Land And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་འདུལ་ཡ་ང་བའི། །དཔྱད་མཁན་ཚེ་ན་བདེ་གཤེགས་ལེགས་མཐོང་དག །འབྲོག་དགོན་བཞུགས་ཚེ་ལྷང་ཚེར་གདུགས་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Aridama, when a scout, Offered a parasol of mica To the well-gone Excellent Sight when he was residing in the wilderness And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་པད་མ་ཕྲེང་རྒྱུད་ཚེ། །དེ་བཞིན་གཤེགས་པ་བཤེས་གཉེན་བཞེད་དེ་ལ། །པད་མ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Padma, when a garland maker, Offered lotuses To the thus-gone Accepted as Friend And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་གྲགས་པ་ནི། །ནོར་བུ་མཁན་ཚེ་བདེ་གཤེགས་སྐལ་བཞེད་ལ། །ནོར་བུ་རིན་ཆེན་མེ་ཤེལ་གཅིག་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Arthakīrti, when a jeweler, Offered a precious fire crystal jewel To the well-gone Accepting the Fortunate And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡེ་ཤེས་འགྲོས་ནི་ཀླུ་རྒྱལ་ཚེ། །བདེ་གཤེགས་ཉི་ཞལ་སོས་ཀའི་དུས་དག་ཏུ། །ལམ་དུ་ཞུགས་ཚེ་ཆར་པ་ཕབ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jñānakrama, when a nāga king, Let rain fall When the well-gone Sun Face was traveling during the hot season, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཉོན་མོངས་བྲལ་བ་གར་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཐོགས་མེད་སྤྱན་དེ་ལ། །མེ་ཏོག་ཆུན་པོ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Apagatakleśa, when a dancer, Offered a bouquet of flowers To the thus-gone Unhindered Eye And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འདམ་བུ་དབུལ་པོའི་བུར་གྱུར་ཚེ། །དགོན་པར་བདེ་གཤེགས་སེང་གེའི་སྟབས་དེ་ལ། །བཤོས་དྲོན་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Nala, when an impoverished child, Offered hot food in the wilderness To the well-gone Lion Gait And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྤོས་བཟངས་བྲམ་ཟེའི་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྒྲོན་མ་ཆེ་དེ་ལ། །ལོ་མ་དག་ལས་བྱས་པའི་གདུགས་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sugandha, when the son of a brahmin, Offered a parasol made of leaves To the thus-gone Great Lamp And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡུལ་འཁོར་རངས་ནི་ཤིང་སྲུངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་བཞོན་པར་མཛད་དེ་ལ། །བསིལ་ཡབ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Anupamarāṣṭra, when a guard of a field, Offered a fan To the thus-gone Provider of Carriage And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལྷ་གྲགས་གྲོང་ཁྱེར་རྟེན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་གསལ་དེ་ལ། །སོ་རས་ན་བཟའ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Marudyaśas, when a city beggar, Offered ragged garments To the thus-gone Luminous Qualities And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྲིད་མཐའ་གཟིགས་པ་ལམ་སྟོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་སྙིང་པོ་ཡི། །ལམ་སྲང་དག་ནི་མཚོན་པ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Bhavāntadarśin, when a travel guide, Showed the way To the thus-gone Merit Essence And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཟླ་བ་སྤོས་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཆོས་དེ་འཆག་པའི་ཚེ། །དུས་ཀྱི་རྗེས་འབྲང་སྤོས་ནི་ཞོ་གཅིག་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Candra, when an incense merchant, Offered rare sandalwood incense To the thus-gone Dharma when he was walking in meditation And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྒྲ་གཅན་ལས་མིའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷ་དགའ་དེ་ལ་ནི། །ཕྱག་འཁར་གཅིག་ཅིག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Rāhu, when a laborer, Offered a walking staff To the thus-gone Divine Joy And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་ཟླ་བ་རྒྱལ་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བསྙེངས་མེད་དགྱེས་དེ་ལ། །ཏ་ལ་པ་ཏ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnacandra, when a prince, Offered a palm-leaf fanTo the thus-gone Fearless Joy And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སེང་གེའི་རྒྱལ་མཚན་རྫ་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཤེས་རབ་རྒྱལ་མཚན་ལ། །སུམ་པ་ཀ་ཡི་ལྷུང་བཟེད་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Siṃhadhvaja, when a potter, Offered an alms bowl To the thus-gone Banner of Insight And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བསམ་གཏན་དགྱེས་པ་གྲོང་ཁྱེར་གྱི། །ཕོ་ཉའི་ཚེ་ན་བདེ་གཤེགས་མདངས་འོད་ལ། །མེ་ཏོག་ཆུན་པོ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Dhyānarata, when a city messenger, Offered a bouquet of flowers To the well-gone Bright Light And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་རྫོགས་ལྡན་རྔོན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླས་བྱིན་དེ་ལ་ནི། །མིག་མི་འཛུམས་པར་བལྟ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Anupama, when a hunter, Looked without blinking At the thus-gone Moon Gift And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་རྣམ་རོལ་རྒྱལ་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་དབྱིག་དེ་ལ། །དཔག་ཚད་ཁོར་ཡུག་མེ་ཏོག་ཆལ་བཀྲམ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Vikrīḍita, when a prince, Spread out a blanket of flowers covering one league Before the thus-gone Treasure of Qualities And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་རིན་ཆེན་ལྗོངས་གཙོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཐའ་ཡས་འོད་དེ་ལ། །མེ་ཏོག་ཙམ་པ་ཀ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇaratna, when the head of a province, Offered campaka flowers To the thus-gone Infinite Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དགྲ་བཅོམ་གྲགས་པ་མཉན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དེས་པ་པོ་དེ་ནི། །གྲུ་དག་གིས་ནི་བསྒྲལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Arhadyaśas, when a ferryman, Took over by boat The thus-gone Gentle And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་པ་དངོས་འབྲུ་མར་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་གྲགས་པའི་ཏོག་དེ་ལ། །དྲི་ཞིམ་ཞབས་བསྐུ་བ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Padmapārśva, when an oil producer, Offered a fragrant foot ointment To the thus-gone Crest of Fame And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཛོད་སྤུ་ལྡན་པ་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བསྙེངས་མེད་ང་རོ་ལ། །ལྷུང་བཟེད་ཞོ་ཡིས་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ūrṇāvat, when a businessman, Offered an alms bowl filled with yogurt To the thus-gone Fearless Roar And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྤོས་གྲགས་ཚོང་པའི་ཁོལ་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་ཡོན་ཏན་ལ། །ལན་ཚ་སྲང་འགའ་ཞིག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Pratibhāna­kīrti, when the servant of a businessman, Offered a measure of salt To the thus-gone Universal Qualities And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེ་ནོར་བུ་ཡིས། །དེ་བཞིན་གཤེགས་པ་འབར་བའི་ཏོག་དེ་ལ། །ཚོད་སྔོན་ཆང་པ་གང་ཞིག་བསོད་སྙོམས་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Maṇivajra Offered a bunch of vegetables To the thus-gone Blazing Crest And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཚེ་དཔག་མེད་ནི་སྨན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྲེད་མེད་བུ་དེ་ལ། །མིག་སྨན་རི་ལུ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Amitāyus, when a physician, Offered pills containing eye medicine To the thus-gone Nārāyaṇa And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ནོར་བུ་བཀོད་པ་ཁྱེའུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་གསལ་བ་ཡི། །ལམ་སྲང་དག་ཏུ་མེ་ཏོག་དཀར་པོ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Maṇivyūha, when a young boy, Offered white flowers in a lane Before the thus-gone Luminous Jewel And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དབང་ཆེན་གྱད་ཀྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་དགོངས་དེ་ལ། །ཀོ་དྲ་བ་ཡི་འབྲུ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Mahendra, when an athlete, Offered kodrava grain To the thus-gone Universal Understanding And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་འབྱུང་གནས་བྲམ་ཟེའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལེགས་སེམས་དེ་ལ་ནི། །རིལ་པ་གཅིག་ཅིག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇākara, when a brahmin, Offered a water pot To the thus-gone Excellent Mind And in doing so first gave rise to the mind of awakening.
